let logId2Title = {
  1: '修改信用',
  2: '恢复额度',
  3: '玩家充值',
  4: '玩家提现',
  5: '带入冻结',
  6: '带入解冻',
  7: '玩家战绩',
  8: '玩家反水',
  9: '俱乐部股份',
  10: '购买钻石',
  11: '平台修正',
  99: '全部初始化',
  101: '修改押金',
  102: '联盟充值',
  103: '联盟提现',
  104: '战绩归还',
  105: '联盟反水',
  106: '担保分成',
  107: '联盟股份',
  108: '押金初始化',
  109: '钻石消费',
  110: '平台修正',
}

let logTitle2Id = {}
for(let id in logId2Title) {
  logTitle2Id[logId2Title[id]] = id
}

let opLogTitle = {
  1001: '绑定俱乐部',
  1002: '解绑俱乐部',
  1003: '强制离桌',
  1004: '踢出联盟',
  1005: '清理免审',
  1006: '设置管理',
  1007: '取消管理',
  1008: '同意入会',
  1010: '登录账号',
  // 1009: '删俱乐部',
}

module.exports = {
  logTitle2Id,
  logId2Title,
  opLogTitle
}
